benchmarks/artillery.yml
config:
  target: "http://localhost:4000"
  http:
    pool: 10 # All HTTP requests from all virtual users will be sent over the same 10 connections
  phases:
    - duration: 10
      arrivalRate: 300
  variables:
    eventName: 
      - "LOGIN_FAILED"
    ip:
      - "10.0.0.1"
      # - "10.0.0.2"
      # - "10.0.0.3"
      # - "10.0.0.4"
    email:
      - "test1@test.com"
      - "test2@test.com"
      - "test3@test.com"
scenarios:
  - name: "GraphQL microservice load test"
    flow:
      - post:
          url: "/"
          json:
            query: "query($ip:String!, $email: String!) { ratelimit(ratelimitInput: {eventName: LOGIN_FAILED, ip: $ip, email: $email}) { ipFrom isRateLimited } }"
            variables: "{ \"ip\": \"{{ip}}\", \"email\": \"{{email}}\" }"
            # query: "{ serverinfo { hostIPs hostname } }"
          # for debug
          # capture:
            # capturing responce using reg expression
      #         - regexp: "[^]*"
      #           as: "response"
      # - log: "response: {{response}}"